artillery/paisley2.yml
config:
  # load testing for API endpoints
  # - will keep ramping up numbers until it breaks "more"
  target: http://3.84.61.211
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 55
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 100
      name: Ramp up load
    - duration: 30
      arrivalRate: 11
      rampTo: 1000
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
          - get:
              url: '/'
          - get:
              url: '/knowledge-bases'
          - get:
              url: '/chatbots'
          # - post:
              # url: '/api/query'
              # json:
                # chatbot_id: '66bfdb451fc3e5a1372b19ad'
                # query: 'tell me about llms'
          - get:
              url: '/history'
          - get:
              url: '/metrics'
        count: 1